; domain
(define (domain minecraft)
  (:requirements :typing)

  (:types
    location                            ; Position in 3D space
    block                               ; Block, that can be manipulated with
  )

  (:predicates
    (at-robot ?l - location)            ; Robot position
    (at-block ?b - block ?l - location) ; Block position
    (on ?top - block ?bottom - block)   ; Top is on the Bottom (Removed comma here)
    (on-ground ?b - block)              ; The block `b` is on the ground
    (free-ground ?l - location)         ; Ground at `l` does not have a block there
    (clear ?b - block)                  ; No block above block `b`
    (handempty)                         ; If robot has free hands
    (holding ?b - block)                ; Robot is holding block `b`
    (adjacent ?l1 ?l2 - location)       ; If two locations are adjacent
  )

  (:action move
    :parameters (?from ?to - location)  ; Move from `from` location to `to` location
    :precondition (and
      (at-robot ?from)                  ; Robot is at starting location `from`
      (adjacent ?from ?to)              ; `from` and `to` are adjacent
    )
    :effect (and
      (not (at-robot ?from))            ; Remove robot from `from`
      (at-robot ?to)                    ; Add robot to `to`
    )
  )

  (:action pick-up-from-ground
   :parameters (
      ?b - block                        ; Block to pick-up
      ?bloc - location                  ; Block location
      ?rloc - location                  ; Robot location
    )
    :precondition(and
      (at-robot ?rloc)                  ; Robot must be at robot location
      (at-block ?b ?bloc)               ; Block to pick-up must be at block location
      (adjacent ?rloc ?bloc)            ; Robot must be next to block to pick-up
      (clear ?b)                        ; Block to pick-up does not have anything above
      (on-ground ?b)                    ; Block to pick-up is on the ground
      (handempty)                       ; Robot must have empty hand to pick-up
    )
    :effect(and
      (not (at-block ?b ?bloc))         ; Block not at the location anymore
      (not (on-ground ?b))
      (not (clear ?b))
      (free-ground ?bloc)
      (not (handempty))                 ; Not empty hand anymore
      (holding ?b)                      ; Block `b` in hand
    )
  )

  (:action pick-up-from-block
   :parameters (
     ?top - block                       ; Block to pick-up (top one)
     ?bottom - block                    ; Block `bottom` the `top` one
     ?bloc - location                   ; Location of the stack
     ?rloc - location                   ; Robot location
   )
   :precondition(and
     (at-robot ?rloc)                   ; Robot must be at robot location
     (at-block ?top ?bloc)              ; `Top` block is where it should be
     (at-block ?bottom ?bloc)           ; `Bottom` block is where it should be
     (on ?top ?bottom)                  ; `Top` is on `bottom` block
     (adjacent ?rloc ?bloc)             ; Robot is next to the stack
     (clear ?top)                       ; Nothing is on `top` block
     (handempty)                        ; Robot must have empty hand to pick-up
   )
   :effect(and
     (not (at-block ?top ?bloc))        ; Fixed ?toploc to ?bloc
     (not (on ?top ?bottom))            ; `Top` is no longer on the `bottom`
     (not (clear ?top))
     (clear ?bottom)                    ; `Bottom` now does not block above
     (not (handempty))                  ; Not empty hand anymore
     (holding ?top)                     ; Fixed ?b to ?top
   )
  )

  (:action put-down-on-ground           ; Put a block on the ground
    :parameters(
      ?b - block                        ; Block to put-down
      ?bloc - location                  ; Where to put it
      ?rloc - location                  ; Robot location
    )
    :precondition(and
      (at-robot ?rloc)                  ; Robot is on the location
      (adjacent ?rloc ?bloc)            ; Robot is next to the location to put-down the block
      (free-ground ?bloc)
      (holding ?b)
    )
    :effect(and
      (at-block ?b ?bloc)
      (on-ground ?b)                    ; Added this back so the block registers as on the ground!
      (clear ?b)                        ; Fixed ?bloc to ?b (blocks are clear, not locations)
      (not (free-ground ?bloc))
      (not (holding ?b))
      (handempty)
    )
  )

  (:action put-down-on-block
   :parameters(
     ?top - block                       ; Block currently in hand
     ?bottom - block                    ; Block to place it on
     ?bloc - location                   ; Location of the target block
     ?rloc - location                   ; Robot location
    )
   :precondition(and
     (at-robot ?rloc)
     (at-block ?bottom ?bloc)           ; Target block is at this location
     (adjacent ?rloc ?bloc)             ; Robot is next to the target block
     (clear ?bottom)                    ; Target block has nothing on it
     (holding ?top)                     ; Robot is holding the top block
    )
   :effect(and
     (not (holding ?top))
     (handempty)
     (at-block ?top ?bloc)              ; The top block is now at this grid location
     (on ?top ?bottom)                  ; The top block is on the bottom block
     (clear ?top)                       ; The top block is now clear
     (not (clear ?bottom))              ; The bottom block is no longer clear
    )
  )
)

; problem
(define (problem minecraft-build)
  (:domain minecraft)

  (:objects
    loc_0_0 loc_0_1 loc_0_2 loc_0_3 loc_0_4 loc_0_5 loc_1_0 loc_1_1 loc_1_2 loc_1_3 loc_1_4 loc_1_5 loc_2_0 loc_2_1 loc_2_2 loc_2_3 loc_2_4 loc_2_5 loc_3_0 loc_3_1 loc_3_2 loc_3_3 loc_3_4 loc_3_5 loc_4_0 loc_4_1 loc_4_2 loc_4_3 loc_4_4 loc_4_5 - location
    b1 b2 b3 b4 b5 - block
  )

  (:init
    (handempty)
    (at-robot loc_0_0)
    (adjacent loc_0_0 loc_1_0)
    (adjacent loc_0_0 loc_0_1)
    (adjacent loc_0_1 loc_1_1)
    (adjacent loc_0_1 loc_0_0)
    (adjacent loc_0_1 loc_0_2)
    (adjacent loc_0_2 loc_1_2)
    (adjacent loc_0_2 loc_0_1)
    (adjacent loc_0_2 loc_0_3)
    (adjacent loc_0_3 loc_1_3)
    (adjacent loc_0_3 loc_0_2)
    (adjacent loc_0_3 loc_0_4)
    (adjacent loc_0_4 loc_1_4)
    (adjacent loc_0_4 loc_0_3)
    (adjacent loc_0_4 loc_0_5)
    (adjacent loc_0_5 loc_1_5)
    (adjacent loc_0_5 loc_0_4)
    (adjacent loc_1_0 loc_0_0)
    (adjacent loc_1_0 loc_2_0)
    (adjacent loc_1_0 loc_1_1)
    (adjacent loc_1_1 loc_0_1)
    (adjacent loc_1_1 loc_2_1)
    (adjacent loc_1_1 loc_1_0)
    (adjacent loc_1_1 loc_1_2)
    (adjacent loc_1_2 loc_0_2)
    (adjacent loc_1_2 loc_2_2)
    (adjacent loc_1_2 loc_1_1)
    (adjacent loc_1_2 loc_1_3)
    (adjacent loc_1_3 loc_0_3)
    (adjacent loc_1_3 loc_2_3)
    (adjacent loc_1_3 loc_1_2)
    (adjacent loc_1_3 loc_1_4)
    (adjacent loc_1_4 loc_0_4)
    (adjacent loc_1_4 loc_2_4)
    (adjacent loc_1_4 loc_1_3)
    (adjacent loc_1_4 loc_1_5)
    (adjacent loc_1_5 loc_0_5)
    (adjacent loc_1_5 loc_2_5)
    (adjacent loc_1_5 loc_1_4)
    (adjacent loc_2_0 loc_1_0)
    (adjacent loc_2_0 loc_3_0)
    (adjacent loc_2_0 loc_2_1)
    (adjacent loc_2_1 loc_1_1)
    (adjacent loc_2_1 loc_3_1)
    (adjacent loc_2_1 loc_2_0)
    (adjacent loc_2_1 loc_2_2)
    (adjacent loc_2_2 loc_1_2)
    (adjacent loc_2_2 loc_3_2)
    (adjacent loc_2_2 loc_2_1)
    (adjacent loc_2_2 loc_2_3)
    (adjacent loc_2_3 loc_1_3)
    (adjacent loc_2_3 loc_3_3)
    (adjacent loc_2_3 loc_2_2)
    (adjacent loc_2_3 loc_2_4)
    (adjacent loc_2_4 loc_1_4)
    (adjacent loc_2_4 loc_3_4)
    (adjacent loc_2_4 loc_2_3)
    (adjacent loc_2_4 loc_2_5)
    (adjacent loc_2_5 loc_1_5)
    (adjacent loc_2_5 loc_3_5)
    (adjacent loc_2_5 loc_2_4)
    (adjacent loc_3_0 loc_2_0)
    (adjacent loc_3_0 loc_4_0)
    (adjacent loc_3_0 loc_3_1)
    (adjacent loc_3_1 loc_2_1)
    (adjacent loc_3_1 loc_4_1)
    (adjacent loc_3_1 loc_3_0)
    (adjacent loc_3_1 loc_3_2)
    (adjacent loc_3_2 loc_2_2)
    (adjacent loc_3_2 loc_4_2)
    (adjacent loc_3_2 loc_3_1)
    (adjacent loc_3_2 loc_3_3)
    (adjacent loc_3_3 loc_2_3)
    (adjacent loc_3_3 loc_4_3)
    (adjacent loc_3_3 loc_3_2)
    (adjacent loc_3_3 loc_3_4)
    (adjacent loc_3_4 loc_2_4)
    (adjacent loc_3_4 loc_4_4)
    (adjacent loc_3_4 loc_3_3)
    (adjacent loc_3_4 loc_3_5)
    (adjacent loc_3_5 loc_2_5)
    (adjacent loc_3_5 loc_4_5)
    (adjacent loc_3_5 loc_3_4)
    (adjacent loc_4_0 loc_3_0)
    (adjacent loc_4_0 loc_4_1)
    (adjacent loc_4_1 loc_3_1)
    (adjacent loc_4_1 loc_4_0)
    (adjacent loc_4_1 loc_4_2)
    (adjacent loc_4_2 loc_3_2)
    (adjacent loc_4_2 loc_4_1)
    (adjacent loc_4_2 loc_4_3)
    (adjacent loc_4_3 loc_3_3)
    (adjacent loc_4_3 loc_4_2)
    (adjacent loc_4_3 loc_4_4)
    (adjacent loc_4_4 loc_3_4)
    (adjacent loc_4_4 loc_4_3)
    (adjacent loc_4_4 loc_4_5)
    (adjacent loc_4_5 loc_3_5)
    (adjacent loc_4_5 loc_4_4)
    (at-block b1 loc_1_1)
    (on-ground b1)
    (clear b1)
    (at-block b2 loc_2_0)
    (on-ground b2)
    (clear b2)
    (at-block b3 loc_3_3)
    (on-ground b3)
    (clear b3)
    (at-block b4 loc_4_4)
    (on-ground b4)
    (clear b4)
    (at-block b5 loc_1_2)
    (on-ground b5)
    (clear b5)
    (free-ground loc_0_0)
    (free-ground loc_0_1)
    (free-ground loc_0_2)
    (free-ground loc_0_3)
    (free-ground loc_0_4)
    (free-ground loc_0_5)
    (free-ground loc_1_0)
    (free-ground loc_1_3)
    (free-ground loc_1_4)
    (free-ground loc_1_5)
    (free-ground loc_2_1)
    (free-ground loc_2_2)
    (free-ground loc_2_3)
    (free-ground loc_2_4)
    (free-ground loc_2_5)
    (free-ground loc_3_0)
    (free-ground loc_3_1)
    (free-ground loc_3_2)
    (free-ground loc_3_4)
    (free-ground loc_3_5)
    (free-ground loc_4_0)
    (free-ground loc_4_1)
    (free-ground loc_4_2)
    (free-ground loc_4_3)
    (free-ground loc_4_5)
  )

  (:goal (and
    (at-block b1 loc_2_3)
    (on-ground b1)
    (at-block b2 loc_2_3)
    (on b2 b1)
    (at-block b3 loc_2_3)
    (on b3 b2)
    (at-block b4 loc_2_3)
    (on b4 b3)
    (at-block b5 loc_2_3)
    (on b5 b4)
  ))
)

; plan
1. (move loc_0_0 loc_1_0)
   deleted: (at-robot loc_0_0)
   added: (at-robot loc_1_0)
   goals met: 1 of 10
2. (pick-up-from-ground b2 loc_2_0 loc_1_0)
   deleted: (at-block b2 loc_2_0) (on-ground b2) (clear b2) (handempty)
   added: (free-ground loc_2_0) (holding b2)
   goals met: 1 of 10
3. (put-down-on-block b2 b1 loc_1_1 loc_1_0)
   deleted: (holding b2) (clear b1)
   added: (handempty) (at-block b2 loc_1_1) (on b2 b1) (clear b2)
   goals met: 2 of 10
4. (move loc_1_0 loc_1_1)
   deleted: (at-robot loc_1_0)
   added: (at-robot loc_1_1)
   goals met: 2 of 10
5. (move loc_1_1 loc_1_2)
   deleted: (at-robot loc_1_1)
   added: (at-robot loc_1_2)
   goals met: 2 of 10
6. (move loc_1_2 loc_1_3)
   deleted: (at-robot loc_1_2)
   added: (at-robot loc_1_3)
   goals met: 2 of 10
7. (pick-up-from-ground b5 loc_1_2 loc_1_3)
   deleted: (at-block b5 loc_1_2) (on-ground b5) (clear b5) (handempty)
   added: (free-ground loc_1_2) (holding b5)
   goals met: 2 of 10
8. (put-down-on-ground b5 loc_2_3 loc_1_3)
   deleted: (free-ground loc_2_3) (holding b5)
   added: (at-block b5 loc_2_3) (on-ground b5) (clear b5) (handempty)
   goals met: 3 of 10
9. (move loc_1_3 loc_2_3)
   deleted: (at-robot loc_1_3)
   added: (at-robot loc_2_3)
   goals met: 3 of 10
10. (pick-up-from-ground b3 loc_3_3 loc_2_3)
   deleted: (at-block b3 loc_3_3) (on-ground b3) (clear b3) (handempty)
   added: (free-ground loc_3_3) (holding b3)
   goals met: 3 of 10
11. (move loc_2_3 loc_1_3)
   deleted: (at-robot loc_2_3)
   added: (at-robot loc_1_3)
   goals met: 3 of 10
12. (put-down-on-block b3 b5 loc_2_3 loc_1_3)
   deleted: (holding b3) (clear b5)
   added: (handempty) (at-block b3 loc_2_3) (on b3 b5) (clear b3)
   goals met: 4 of 10
13. (move loc_1_3 loc_2_3)
   deleted: (at-robot loc_1_3)
   added: (at-robot loc_2_3)
   goals met: 4 of 10
14. (move loc_2_3 loc_3_3)
   deleted: (at-robot loc_2_3)
   added: (at-robot loc_3_3)
   goals met: 4 of 10
15. (move loc_3_3 loc_3_4)
   deleted: (at-robot loc_3_3)
   added: (at-robot loc_3_4)
   goals met: 4 of 10
16. (pick-up-from-ground b4 loc_4_4 loc_3_4)
   deleted: (at-block b4 loc_4_4) (on-ground b4) (clear b4) (handempty)
   added: (free-ground loc_4_4) (holding b4)
   goals met: 4 of 10
17. (move loc_3_4 loc_3_3)
   deleted: (at-robot loc_3_4)
   added: (at-robot loc_3_3)
   goals met: 4 of 10
18. (put-down-on-block b4 b3 loc_2_3 loc_3_3)
   deleted: (holding b4) (clear b3)
   added: (handempty) (at-block b4 loc_2_3) (on b4 b3) (clear b4)
   goals met: 6 of 10
19. (move loc_3_3 loc_2_3)
   deleted: (at-robot loc_3_3)
   added: (at-robot loc_2_3)
   goals met: 6 of 10
20. (move loc_2_3 loc_1_3)
   deleted: (at-robot loc_2_3)
   added: (at-robot loc_1_3)
   goals met: 6 of 10
21. (move loc_1_3 loc_1_2)
   deleted: (at-robot loc_1_3)
   added: (at-robot loc_1_2)
   goals met: 6 of 10
22. (pick-up-from-block b2 b1 loc_1_1 loc_1_2)
   deleted: (at-block b2 loc_1_1) (on b2 b1) (clear b2) (handempty)
   added: (clear b1) (holding b2)
   goals met: 5 of 10
23. (move loc_1_2 loc_1_3)
   deleted: (at-robot loc_1_2)
   added: (at-robot loc_1_3)
   goals met: 5 of 10
24. (put-down-on-block b2 b4 loc_2_3 loc_1_3)
   deleted: (holding b2) (clear b4)
   added: (handempty) (at-block b2 loc_2_3) (on b2 b4) (clear b2)
   goals met: 6 of 10
25. (move loc_1_3 loc_1_2)
   deleted: (at-robot loc_1_3)
   added: (at-robot loc_1_2)
   goals met: 6 of 10
26. (pick-up-from-ground b1 loc_1_1 loc_1_2)
   deleted: (at-block b1 loc_1_1) (on-ground b1) (clear b1) (handempty)
   added: (free-ground loc_1_1) (holding b1)
   goals met: 5 of 10
27. (move loc_1_2 loc_1_1)
   deleted: (at-robot loc_1_2)
   added: (at-robot loc_1_1)
   goals met: 5 of 10
28. (move loc_1_1 loc_2_1)
   deleted: (at-robot loc_1_1)
   added: (at-robot loc_2_1)
   goals met: 5 of 10
29. (move loc_2_1 loc_3_1)
   deleted: (at-robot loc_2_1)
   added: (at-robot loc_3_1)
   goals met: 5 of 10
30. (move loc_3_1 loc_4_1)
   deleted: (at-robot loc_3_1)
   added: (at-robot loc_4_1)
   goals met: 5 of 10
31. (put-down-on-ground b1 loc_4_0 loc_4_1)
   deleted: (free-ground loc_4_0) (holding b1)
   added: (at-block b1 loc_4_0) (on-ground b1) (clear b1) (handempty)
   goals met: 6 of 10
32. (move loc_4_1 loc_3_1)
   deleted: (at-robot loc_4_1)
   added: (at-robot loc_3_1)
   goals met: 6 of 10
33. (move loc_3_1 loc_2_1)
   deleted: (at-robot loc_3_1)
   added: (at-robot loc_2_1)
   goals met: 6 of 10
34. (move loc_2_1 loc_2_2)
   deleted: (at-robot loc_2_1)
   added: (at-robot loc_2_2)
   goals met: 6 of 10
35. (move loc_2_2 loc_3_2)
   deleted: (at-robot loc_2_2)
   added: (at-robot loc_3_2)
   goals met: 6 of 10
36. (move loc_3_2 loc_3_3)
   deleted: (at-robot loc_3_2)
   added: (at-robot loc_3_3)
   goals met: 6 of 10
37. (pick-up-from-block b2 b4 loc_2_3 loc_3_3)
   deleted: (at-block b2 loc_2_3) (on b2 b4) (clear b2) (handempty)
   added: (clear b4) (holding b2)
   goals met: 5 of 10
38. (put-down-on-ground b2 loc_3_2 loc_3_3)
   deleted: (free-ground loc_3_2) (holding b2)
   added: (at-block b2 loc_3_2) (on-ground b2) (clear b2) (handempty)
   goals met: 5 of 10
39. (pick-up-from-block b4 b3 loc_2_3 loc_3_3)
   deleted: (at-block b4 loc_2_3) (on b4 b3) (clear b4) (handempty)
   added: (clear b3) (holding b4)
   goals met: 3 of 10
40. (put-down-on-ground b4 loc_3_4 loc_3_3)
   deleted: (free-ground loc_3_4) (holding b4)
   added: (at-block b4 loc_3_4) (on-ground b4) (clear b4) (handempty)
   goals met: 3 of 10
41. (pick-up-from-block b3 b5 loc_2_3 loc_3_3)
   deleted: (at-block b3 loc_2_3) (on b3 b5) (clear b3) (handempty)
   added: (clear b5) (holding b3)
   goals met: 2 of 10
42. (put-down-on-block b3 b2 loc_3_2 loc_3_3)
   deleted: (holding b3) (clear b2)
   added: (handempty) (at-block b3 loc_3_2) (on b3 b2) (clear b3)
   goals met: 3 of 10
43. (pick-up-from-ground b5 loc_2_3 loc_3_3)
   deleted: (at-block b5 loc_2_3) (on-ground b5) (clear b5) (handempty)
   added: (free-ground loc_2_3) (holding b5)
   goals met: 2 of 10
44. (put-down-on-ground b5 loc_4_3 loc_3_3)
   deleted: (free-ground loc_4_3) (holding b5)
   added: (at-block b5 loc_4_3) (on-ground b5) (clear b5) (handempty)
   goals met: 2 of 10
45. (pick-up-from-ground b4 loc_3_4 loc_3_3)
   deleted: (at-block b4 loc_3_4) (on-ground b4) (clear b4) (handempty)
   added: (free-ground loc_3_4) (holding b4)
   goals met: 2 of 10
46. (put-down-on-block b4 b3 loc_3_2 loc_3_3)
   deleted: (holding b4) (clear b3)
   added: (handempty) (at-block b4 loc_3_2) (on b4 b3) (clear b4)
   goals met: 3 of 10
47. (move loc_3_3 loc_4_3)
   deleted: (at-robot loc_3_3)
   added: (at-robot loc_4_3)
   goals met: 3 of 10
48. (move loc_4_3 loc_4_2)
   deleted: (at-robot loc_4_3)
   added: (at-robot loc_4_2)
   goals met: 3 of 10
49. (pick-up-from-block b4 b3 loc_3_2 loc_4_2)
   deleted: (at-block b4 loc_3_2) (on b4 b3) (clear b4) (handempty)
   added: (clear b3) (holding b4)
   goals met: 2 of 10
50. (put-down-on-ground b4 loc_4_1 loc_4_2)
   deleted: (free-ground loc_4_1) (holding b4)
   added: (at-block b4 loc_4_1) (on-ground b4) (clear b4) (handempty)
   goals met: 2 of 10
51. (pick-up-from-ground b5 loc_4_3 loc_4_2)
   deleted: (at-block b5 loc_4_3) (on-ground b5) (clear b5) (handempty)
   added: (free-ground loc_4_3) (holding b5)
   goals met: 2 of 10
52. (put-down-on-block b5 b3 loc_3_2 loc_4_2)
   deleted: (holding b5) (clear b3)
   added: (handempty) (at-block b5 loc_3_2) (on b5 b3) (clear b5)
   goals met: 2 of 10
53. (move loc_4_2 loc_4_1)
   deleted: (at-robot loc_4_2)
   added: (at-robot loc_4_1)
   goals met: 2 of 10
54. (pick-up-from-ground b1 loc_4_0 loc_4_1)
   deleted: (at-block b1 loc_4_0) (on-ground b1) (clear b1) (handempty)
   added: (free-ground loc_4_0) (holding b1)
   goals met: 1 of 10
55. (put-down-on-ground b1 loc_3_1 loc_4_1)
   deleted: (free-ground loc_3_1) (holding b1)
   added: (at-block b1 loc_3_1) (on-ground b1) (clear b1) (handempty)
   goals met: 2 of 10
56. (move loc_4_1 loc_3_1)
   deleted: (at-robot loc_4_1)
   added: (at-robot loc_3_1)
   goals met: 2 of 10
57. (pick-up-from-ground b4 loc_4_1 loc_3_1)
   deleted: (at-block b4 loc_4_1) (on-ground b4) (clear b4) (handempty)
   added: (free-ground loc_4_1) (holding b4)
   goals met: 2 of 10
58. (put-down-on-ground b4 loc_3_0 loc_3_1)
   deleted: (free-ground loc_3_0) (holding b4)
   added: (at-block b4 loc_3_0) (on-ground b4) (clear b4) (handempty)
   goals met: 2 of 10
59. (pick-up-from-block b5 b3 loc_3_2 loc_3_1)
   deleted: (at-block b5 loc_3_2) (on b5 b3) (clear b5) (handempty)
   added: (clear b3) (holding b5)
   goals met: 2 of 10
60. (put-down-on-block b5 b4 loc_3_0 loc_3_1)
   deleted: (holding b5) (clear b4)
   added: (handempty) (at-block b5 loc_3_0) (on b5 b4) (clear b5)
   goals met: 3 of 10
61. (pick-up-from-block b3 b2 loc_3_2 loc_3_1)
   deleted: (at-block b3 loc_3_2) (on b3 b2) (clear b3) (handempty)
   added: (clear b2) (holding b3)
   goals met: 2 of 10
62. (put-down-on-block b3 b5 loc_3_0 loc_3_1)
   deleted: (holding b3) (clear b5)
   added: (handempty) (at-block b3 loc_3_0) (on b3 b5) (clear b3)
   goals met: 2 of 10
63. (move loc_3_1 loc_2_1)
   deleted: (at-robot loc_3_1)
   added: (at-robot loc_2_1)
   goals met: 2 of 10
64. (pick-up-from-ground b1 loc_3_1 loc_2_1)
   deleted: (at-block b1 loc_3_1) (on-ground b1) (clear b1) (handempty)
   added: (free-ground loc_3_1) (holding b1)
   goals met: 1 of 10
65. (move loc_2_1 loc_2_2)
   deleted: (at-robot loc_2_1)
   added: (at-robot loc_2_2)
   goals met: 1 of 10
66. (put-down-on-ground b1 loc_2_3 loc_2_2)
   deleted: (free-ground loc_2_3) (holding b1)
   added: (at-block b1 loc_2_3) (on-ground b1) (clear b1) (handempty)
   goals met: 3 of 10
67. (pick-up-from-ground b2 loc_3_2 loc_2_2)
   deleted: (at-block b2 loc_3_2) (on-ground b2) (clear b2) (handempty)
   added: (free-ground loc_3_2) (holding b2)
   goals met: 3 of 10
68. (put-down-on-block b2 b1 loc_2_3 loc_2_2)
   deleted: (holding b2) (clear b1)
   added: (handempty) (at-block b2 loc_2_3) (on b2 b1) (clear b2)
   goals met: 5 of 10
69. (move loc_2_2 loc_3_2)
   deleted: (at-robot loc_2_2)
   added: (at-robot loc_3_2)
   goals met: 5 of 10
70. (move loc_3_2 loc_3_1)
   deleted: (at-robot loc_3_2)
   added: (at-robot loc_3_1)
   goals met: 5 of 10
71. (pick-up-from-block b3 b5 loc_3_0 loc_3_1)
   deleted: (at-block b3 loc_3_0) (on b3 b5) (clear b3) (handempty)
   added: (clear b5) (holding b3)
   goals met: 5 of 10
72. (put-down-on-ground b3 loc_3_2 loc_3_1)
   deleted: (free-ground loc_3_2) (holding b3)
   added: (at-block b3 loc_3_2) (on-ground b3) (clear b3) (handempty)
   goals met: 5 of 10
73. (pick-up-from-block b5 b4 loc_3_0 loc_3_1)
   deleted: (at-block b5 loc_3_0) (on b5 b4) (clear b5) (handempty)
   added: (clear b4) (holding b5)
   goals met: 4 of 10
74. (put-down-on-ground b5 loc_4_1 loc_3_1)
   deleted: (free-ground loc_4_1) (holding b5)
   added: (at-block b5 loc_4_1) (on-ground b5) (clear b5) (handempty)
   goals met: 4 of 10
75. (pick-up-from-ground b4 loc_3_0 loc_3_1)
   deleted: (at-block b4 loc_3_0) (on-ground b4) (clear b4) (handempty)
   added: (free-ground loc_3_0) (holding b4)
   goals met: 4 of 10
76. (put-down-on-block b4 b3 loc_3_2 loc_3_1)
   deleted: (holding b4) (clear b3)
   added: (handempty) (at-block b4 loc_3_2) (on b4 b3) (clear b4)
   goals met: 5 of 10
77. (pick-up-from-ground b5 loc_4_1 loc_3_1)
   deleted: (at-block b5 loc_4_1) (on-ground b5) (clear b5) (handempty)
   added: (free-ground loc_4_1) (holding b5)
   goals met: 5 of 10
78. (put-down-on-block b5 b4 loc_3_2 loc_3_1)
   deleted: (holding b5) (clear b4)
   added: (handempty) (at-block b5 loc_3_2) (on b5 b4) (clear b5)
   goals met: 6 of 10
79. (move loc_3_1 loc_2_1)
   deleted: (at-robot loc_3_1)
   added: (at-robot loc_2_1)
   goals met: 6 of 10
80. (move loc_2_1 loc_2_2)
   deleted: (at-robot loc_2_1)
   added: (at-robot loc_2_2)
   goals met: 6 of 10
81. (pick-up-from-block b5 b4 loc_3_2 loc_2_2)
   deleted: (at-block b5 loc_3_2) (on b5 b4) (clear b5) (handempty)
   added: (clear b4) (holding b5)
   goals met: 5 of 10
82. (put-down-on-block b5 b2 loc_2_3 loc_2_2)
   deleted: (holding b5) (clear b2)
   added: (handempty) (at-block b5 loc_2_3) (on b5 b2) (clear b5)
   goals met: 6 of 10
83. (pick-up-from-block b4 b3 loc_3_2 loc_2_2)
   deleted: (at-block b4 loc_3_2) (on b4 b3) (clear b4) (handempty)
   added: (clear b3) (holding b4)
   goals met: 5 of 10
84. (put-down-on-ground b4 loc_1_2 loc_2_2)
   deleted: (free-ground loc_1_2) (holding b4)
   added: (at-block b4 loc_1_2) (on-ground b4) (clear b4) (handempty)
   goals met: 5 of 10
85. (pick-up-from-block b5 b2 loc_2_3 loc_2_2)
   deleted: (at-block b5 loc_2_3) (on b5 b2) (clear b5) (handempty)
   added: (clear b2) (holding b5)
   goals met: 4 of 10
86. (put-down-on-block b5 b4 loc_1_2 loc_2_2)
   deleted: (holding b5) (clear b4)
   added: (handempty) (at-block b5 loc_1_2) (on b5 b4) (clear b5)
   goals met: 5 of 10
87. (pick-up-from-ground b3 loc_3_2 loc_2_2)
   deleted: (at-block b3 loc_3_2) (on-ground b3) (clear b3) (handempty)
   added: (free-ground loc_3_2) (holding b3)
   goals met: 5 of 10
88. (put-down-on-block b3 b2 loc_2_3 loc_2_2)
   deleted: (holding b3) (clear b2)
   added: (handempty) (at-block b3 loc_2_3) (on b3 b2) (clear b3)
   goals met: 7 of 10
89. (pick-up-from-block b5 b4 loc_1_2 loc_2_2)
   deleted: (at-block b5 loc_1_2) (on b5 b4) (clear b5) (handempty)
   added: (clear b4) (holding b5)
   goals met: 6 of 10
90. (put-down-on-ground b5 loc_3_2 loc_2_2)
   deleted: (free-ground loc_3_2) (holding b5)
   added: (at-block b5 loc_3_2) (on-ground b5) (clear b5) (handempty)
   goals met: 6 of 10
91. (pick-up-from-ground b4 loc_1_2 loc_2_2)
   deleted: (at-block b4 loc_1_2) (on-ground b4) (clear b4) (handempty)
   added: (free-ground loc_1_2) (holding b4)
   goals met: 6 of 10
92. (put-down-on-block b4 b3 loc_2_3 loc_2_2)
   deleted: (holding b4) (clear b3)
   added: (handempty) (at-block b4 loc_2_3) (on b4 b3) (clear b4)
   goals met: 8 of 10
93. (pick-up-from-ground b5 loc_3_2 loc_2_2)
   deleted: (at-block b5 loc_3_2) (on-ground b5) (clear b5) (handempty)
   added: (free-ground loc_3_2) (holding b5)
   goals met: 8 of 10
94. (put-down-on-block b5 b4 loc_2_3 loc_2_2)
   deleted: (holding b5) (clear b4)
   added: (handempty) (at-block b5 loc_2_3) (on b5 b4) (clear b5)
   goals met: 10 of 10
